IDEA Connection Link
ConnectionSrv.GetDetailedConResultsJSON Method
 Get detailed results of checks inJSOM
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public string GetDetailedConResultsJSON(
	Guid connectionId
)
Public Function GetDetailedConResultsJSON (
	connectionId As Guid
) As String
public:
String^ GetDetailedConResultsJSON(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetDetailedConResultsJSON(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetDetailedConResultsJSON(System.Guid)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace